Repository: Nacist/gawk
Catalog: gawk-*.po
Languages: pl

source: attempt to use scalar `%s' as array
pl: próba u¿ycia skalara `%s' jako tablicy

source: reference to uninitialized element `%s["%s"]'
pl: odwo³anie do niezainicjowanego elementu `%s["%s"]'

source: subscript of array `%s' is null string
pl: indeks tablicy `%s' jest ³añcuchem pustym

source: delete: illegal use of variable `%s' as array
pl: delete: próba u¿ycia zmiennej `%s' jako tablicy

source: delete: index `%s' not in array `%s'
pl: delete: indeks `%s' spoza tablicy `%s'

source: %s: empty (null)
pl: %s: pusta (null)

source: %s: empty (zero)
pl: %s: pusta (zero)

source: %s: is parameter
pl: %s: jest parametrem

source: %s: array_ref to %s
pl: %s: array_ref do %s

source: asort: first argument is not an array
pl: asort: pierwszy argument nie jest tablic±

source: asort: second argument is not an array
pl: asort: drugi argument nie jest tablic±

source: %s to "%s" failed (%s)
pl: %s do "%s" nie powiod³o siê (%s)

source: standard output
pl: standardowego wyj¶cia

source: reason unknown
pl: powód nieznany

source: exp: received non-numeric argument
pl: exp: otrzymany argument nie jest liczb±

source: exp: argument %g is out of range
pl: exp: argument %g jest spoza zakresu

source: fflush: cannot flush: pipe `%s' opened for reading, not writing
pl: fflush: nie mo¿na opró¿niæ: potok `%s' otwarty do odczytu, a nie zapisu

source: fflush: cannot flush: file `%s' opened for reading, not writing
pl: fflush: nie mo¿na opró¿niæ: plik `%s' otwarty do odczytu, a nie zapisu

source: fflush: `%s' is not an open file, pipe or co-process
pl: fflush: `%s' nie jest otwartym plikiem, potokiem lub ko-procesem

source: index: received non-string first argument
pl: index: otrzymany pierwszy argument nie jest ³añcuchem

source: index: received non-string second argument
pl: index: otrzymany drugi argument nie jest ³añcuchem

source: int: received non-numeric argument
pl: int: otrzymany argument nie jest liczb±

source: length: received non-string argument
pl: length: otrzymany argument nie jest ³añcuchem

source: log: received non-numeric argument
pl: log: otrzymany argument nie jest liczb±

source: log: received negative argument %g
pl: log: otrzymano ujemny argument %g

source: must use `count$' on all formats or none
pl: nale¿y u¿yæ `liczba$' we wszystkich formatach, albo w ¿adnym

source: `$' is not permitted in awk formats
pl: `$' nie jest dozwolone w formatach awka

source: arg count with `$' must be > 0
pl: numer argumentu z `$' musi byæ > 0

source: arg count %d greater than total number of supplied arguments
pl: numer argumentu %d jest wiêkszy ni¿ liczba wszystkich podanych argumentów

source: `$' not permitted after period in format
pl: `$' nie dozwolony po kropce w formacie

source: no `$' supplied for positional field width or precision
pl: nie podano `$' do dla szeroko¶ci pola lub precyzji

source: `l' is meaningless in awk formats; ignored
pl: `l' jest bez znaczenia w formatach awka; zignorowano

source: `l' is not permitted in POSIX awk formats
pl: `l' nie jest dopuszczalne w formatach awka wg POSIX

source: `L' is meaningless in awk formats; ignored
pl: `L' jest bez znaczenia w formatach awka; zignorowano

source: `L' is not permitted in POSIX awk formats
pl: `L' nie jest dopuszczalne w formatach awka wg POSIX

source: `h' is meaningless in awk formats; ignored
pl: `h' jest bez znaczenia w formatach awka; zignorowano

source: `h' is not permitted in POSIX awk formats
pl: `h' nie jest dopuszczalne w formatach awka wg POSIX

source: not enough arguments to satisfy format string
pl: za ma³o argumentów, aby zaspokoiæ ³añcuch formatuj±cy

source: ^ ran out for this one
pl: ^ zabrak³o dla tego

source: [s]printf: format specifier does not have control letter
pl: [s]printf: okre¶lenie formatu nie ma litery kontrolnej

source: too many arguments supplied for format string
pl: podano za ma³o argumentów dla ³añcucha formatuj±cego

source: printf: no arguments
pl: printf: brak argumentów

source: sqrt: received non-numeric argument
pl: sqrt: otrzymany argument nie jest liczb±

source: sqrt: called with negative argument %g
pl: sqrt: wywo³ano z ujemnym argumentem %g

source: substr: start index %g is invalid, using 1
pl: substr: pocz±tkowy indeks %g jest b³êdny, u¿yto 1

source: substr: non-integer start index %g will be truncated
pl: substr: nieca³kowity indeks pocz±tkowy %g zostanie obciêty

source: substr: length %g is <= 0
pl: substr: d³ugo¶æ %g jest <= 0

source: substr: non-integer length %g will be truncated
pl: substr: nieca³kowita d³ugo¶æ %g zostanie obciêta

source: substr: source string is zero length
pl: substr: ³añcuch ¼ród³owy jest zerowej d³ugo¶ci

source: substr: length %d at start index %d exceeds length of first argument (%d)
pl: substr: d³ugo¶æ %d od indeksu %d przekracza d³ugo¶æ pierwszego argumentu (%d)

source: substr: start index %d is past end of string
pl: substr: indeks pocz±tkowy %d jest za koñcem ³añcucha

source: strftime: received non-string first argument
pl: strftime: otrzymany pierwszy argument nie jest ³añcuchem

source: strftime: received empty format string
pl: strftime: otrzymano pusty ³añcuch formatuj±cy

source: strftime: received non-numeric second argument
pl: strftime: otrzymany drugi argument nie jest liczb±

source: mktime: received non-string argument
pl: mktime: otrzymany argument nie jest ³añcuchem

source: system: received non-string argument
pl: system: otrzymany argument nie jest ³añcuchem

source: tolower: received non-string argument
pl: tolower: otrzymany argument nie jest ³añcuchem

source: toupper: received non-string argument
pl: toupper: otrzymany argument nie jest ³añcuchem

source: atan2: received non-numeric first argument
pl: atan2: otrzymany pierwszy argument nie jest liczb±

source: atan2: received non-numeric second argument
pl: atan2: otrzymany drugi argument nie jest liczb±

source: sin: received non-numeric argument
pl: sin: otrzymany argument nie jest liczb±

source: cos: received non-numeric argument
pl: cos: otrzymany argument nie jest liczb±

source: srand: received non-numeric argument
pl: srand: otrzymany argument nie jest liczb±

source: match: third argument is not an array
pl: match: trzeci argument nie jest tablic±

source: gensub: 3rd argument of 0 treated as 1
pl: gensub: trzeci argument o warto¶ci 0 potraktowano jako 1

source: lshift: received non-numeric first argument
pl: lshift: otrzymany pierwszy argument nie jest liczb±

source: lshift(%lf, %lf): negative values will give strange results
pl: lshift(%lf, %lf): ujemne warto¶ci dadz± dziwne wyniki

source: lshift(%lf, %lf): fractional values will be truncated
pl: lshift(%lf, %lf): u³amkowe warto¶ci zostan± obciête

source: lshift(%lf, %lf): too large shift value will give strange results
pl: lshift(%lf, %lf): zbyt du¿a warto¶æ przesuniêcia da dziwne wyniki

source: rshift: received non-numeric first argument
pl: rshift: otrzymany pierwszy argument nie jest liczb±

source: rshift(%lf, %lf): negative values will give strange results
pl: rshift(%lf, %lf): ujemne warto¶ci dadz± dziwne wyniki

source: rshift(%lf, %lf): fractional values will be truncated
pl: rshift(%lf, %lf): u³amkowe warto¶ci zostan± obciête

source: rshift(%lf, %lf): too large shift value will give strange results
pl: rshift(%lf, %lf): zbyt du¿a warto¶æ przesuniêcia da dziwne wyniki

source: and: received non-numeric first argument
pl: and: otrzymany pierwszy argument nie jest liczb±

source: and(%lf, %lf): negative values will give strange results
pl: and(%lf, %lf): ujemne warto¶ci dadz± dziwne wyniki

source: and(%lf, %lf): fractional values will be truncated
pl: and(%lf, %lf): u³amkowe warto¶ci zostan± obciête

source: or: received non-numeric first argument
pl: or: otrzymany pierwszy argument nie jest liczb±

source: or(%lf, %lf): negative values will give strange results
pl: or(%lf, %lf): ujemne warto¶ci dadz± dziwne wyniki

source: or(%lf, %lf): fractional values will be truncated
pl: or(%lf, %lf): u³amkowe warto¶ci zostan± obciête

source: xor: received non-numeric first argument
pl: xor: otrzymany pierwszy argument nie jest liczb±

source: xor(%lf, %lf): negative values will give strange results
pl: xor(%lf, %lf): ujemne warto¶ci dadz± dziwne wyniki

source: xor(%lf, %lf): fractional values will be truncated
pl: xor(%lf, %lf): u³amkowe warto¶ci zostan± obciête

source: compl: received non-numeric argument
pl: compl: otrzymany argument nie jest liczb±

source: compl(%lf): negative value will give strange results
pl: compl(%lf): ujemna warto¶æ da dziwne wyniki

source: compl(%lf): fractional value will be truncated
pl: compl(%lf): u³amkowa warto¶æ zostanie obciêta

source: dcgettext: `%s' is not a valid locale category
pl: dcgettext: `%s' nie jest poprawn± kategori± lokalizacji

source: `extension' is a gawk extension
pl: `extension' jest rozszerzeniem gawka

source: extension: cannot open `%s' (%s)
pl: extension: nie mo¿na otworzyæ `%s' (%s)

source: extension: library `%s': cannot call function `%s' (%s)
pl: extension: biblioteka `%s': nie mo¿na wywo³aæ funkcji `%s' (%s)

source: Operation Not Supported
pl: Operacja nie obs³ugiwana

source: %s: option `%s' is ambiguous
pl: %s: opcja `%s' jest niejednoznaczna

source: %s: option `--%s' doesn't allow an argument
pl: %s: opcja `--%s' nie dopuszcza argumentu

source: %s: option `%c%s' doesn't allow an argument
pl: %s: opcja `%c%s' nie dopuszcza argumentu

source: %s: option `%s' requires an argument
pl: %s: opcja `%s' wymaga argumentu

source: %s: unrecognized option `--%s'
pl: %s: nierozpoznana opcja `--%s'

source: %s: unrecognized option `%c%s'
pl: %s: nierozpoznana opcja `%c%s'

source: %s: illegal option -- %c
pl: %s: niedozwolona opcja -- %c

source: %s: invalid option -- %c
pl: %s: b³êdna opcja -- %c

source: %s: option requires an argument -- %c
pl: %s: opcja wymaga argumentu -- %c

source: %s: option `-W %s' is ambiguous
pl: %s: opcja `-W %s' jest niejednoznaczna

source: %s: option `-W %s' doesn't allow an argument
pl: %s: opcja `-W %s' nie dopuszcza argumentu

source: `-m[fr]' option irrelevant in gawk
pl: opcja `-m[fr]' nic nie wnosi w gawku

source: -m option usage: `-m[fr] nnn'
pl: sk³adnia opcji -m: `-m[fr] nnn'

source: %s: option `-W %s' unrecognized, ignored
pl: %s: opcja `-W %s' nierozpoznana, zignorowano

source: empty argument to `--source' ignored
pl: pusty argument dla `--source' zignorowany

source: environment variable `POSIXLY_CORRECT' set: turning on `--posix'
pl: ustawiona zmienna `POSIXLY_CORRECT': w³±czono `--posix'

source: `--posix' overrides `--traditional'
pl: `--posix' uniewa¿nia `--traditional'

source: `--posix'/`--traditional' overrides `--non-decimal-data'
pl: `--posix'/`--traditional' uniewa¿nia `--non-decimal-data'

source: running %s setuid root may be a security problem
pl: uruchamianie %s jako setuid root mo¿e byæ problemem z bezpieczeñstwem

source: can't set mode on stdin (%s)
pl: nie mo¿na ustawiæ trybu dla stdin (%s)

source: can't set mode on stdout (%s)
pl: nie mo¿na ustawiæ trybu dla stdout (%s)

source: can't set mode on stderr (%s)
pl: nie mo¿na ustawiæ trybu dla stderr (%s)

source: no program text at all!
pl: nie ma w ogóle tekstu programu!

source: Usage: %s [POSIX or GNU style options] -f progfile [--] file ...
pl: Sk³adnia: %s [opcje w stylu POSIX lub GNU] -f plik-programu [--] plik ...

source: Usage: %s [POSIX or GNU style options] [--] %cprogram%c file ...
pl: Sk³adnia: %s [opcje w stylu POSIX lub GNU] [--] %cprogram%c plik ...

source: POSIX options: GNU long options:
pl: Opcje POSIX: D³ugie opcje GNU:

source: -f progfile --file=progfile
pl: -f plik-programu --file=plik-programu

source: -F fs --field-separator=fs
pl: -F separator-pól --field-separator=separator-pól

source: -v var=val --assign=var=val
pl: -v zmienna=warto¶æ --assign=zmienna=warto¶æ

source: -m[fr] val
pl: -m[fr] warto¶æ

source: -W dump-variables[=file] --dump-variables[=file]
pl: -W dump-variables[=plik] --dump-variables[=plik]

source: -W profile[=file] --profile[=file]
pl: -W profile[=plik] --profile[=plik]

source: -W source=program-text --source=program-text
pl: -W source=tekst-progr. --source=tekst-programu

source: To report bugs, see node `Bugs' in `gawk.info', which is section `Reporting Problems and Bugs' in the printed version.
pl: Aby zg³osiæ b³êdy, nale¿y zobaczyæ wêze³ `Bugs' w `gawk.info', który jest sekcj± `Reporting Problems and Bugs' w wersji drukowanej.

source: gawk is a pattern scanning and processing language. By default it reads standard input and writes standard output.
pl: gawk to jêzyk przeszukiwania i przetwarzania wzorców. Domy¶lnie czyta ze standardowego wyj¶cia i zapisuje na standardowe wyj¶cie.

source: Examples: gawk '{ sum += $1 }; END { print sum }' file gawk -F: '{ print $1 }' /etc/passwd
pl: Przyk³ady: gawk '{ suma += $1 }; END { print suma }' plik gawk -F: '{ print $1 }' /etc/passwd

source: Copyright (C) 1989, 1991-%d Free Software Foundation. This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
pl: Copyright (C) 1989, 1991-%d Free Software Foundation. Ten program jest darmowy; mo¿na go rozprowadzaæ i/lub modyfikowaæ na warunkach Powszechnej Licencji Publicznej GNU (General Public Licence) opublikowanej przez Free Software Foundation, w wersji 2 lub, do wyboru, dowolnej pó¼niejszej.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
pl: Ten program ten jest rozprowadzany w nadziei, ¿e bêdzie przydatny, ale BEZ ¯ADNEJ GWARANCJI, nawet bez domy¶lnej gwarancji JAKO¦CI lub PRZYDATNO¦CI DO KONKRETNYCH ZASTOSOWAÑ. Szczegó³y znajduj± siê w Powszechnej Licencji Publicznej GNU.

source: You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
pl: Kopia Powszechnej Licencji Publicznej GNU powinna byæ dostarczona wraz z tym programem. Je¶li nie, mo¿na napisaæ do Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.

source: -Ft does not set FS to tab in POSIX awk
pl: -Ft nie ustawia FS na tab w awku zgodnym z POSIX

source: invalid syntax in name `%s' for variable assignment
pl: niew³a¶ciwa dla przypisywania zmiennych sk³adnia w nazwie `%s'

source: floating point exception
pl: wyj±tek operacji zmiennoprzecinkowej

source: fatal error: internal error
pl: b³±d krytyczny: b³±d wewnêtrzny

source: no pre-opened fd %d
pl: break wstêpnie otwartego deskryptora %d

source: could not pre-open /dev/null for fd %d
pl: nie mo¿na wstêpnie otworzyæ /dev/null dla deskryptora %d

source: could not find groups: %s
pl: nie mo¿na znale¼æ grup: %s

source: could not open `%s' for writing: %s
pl: nie mo¿na otworzyæ `%s' do zapisu: %s

source: sending profile to standard error
pl: wysy³anie profilu na standardowe wyj¶cie b³êdów

source: internal error: Node_var with null vname
pl: b³±d wewnêtrzny: Node_var ma puste vname

source: internal error: Node_var_array with null vname
pl: b³±d wewnêtrzny: Node_var_array ma puste vname

source: function `%s' called with space between name and `(', %s
pl: funkcja `%s' wywo³ana ze spacj± miêdzy nazw± a `(', %s

source: or used in other expression context
pl: lub u¿yte w innym kontek¶cie wyra¿enia

source: attempt to use array `%s' in a scalar context
pl: próba u¿ycia tablicy `%s' w kontek¶cie skalara

source: illegal type (%s) in tree_eval
pl: niedozwolony typ (%s) w tree_eval

source: attempt to use function `%s' as array
pl: próba u¿ycia funkcji `%s' jako tablicy

source: `%s' is a function, assignment is not allowed
pl: `%s' jest funkcj±, przypisanie do niej nie jest dozwolone

source: assignment is not allowed to result of builtin function
pl: przypisanie do wyniku wbudowanej funkcji nie jest dozwolone

source: # gawk profile, created %s
pl: # profil gawka, utworzony %s

source: # BEGIN block(s)
pl: # blok(i) BEGIN

source: # Rule(s)
pl: # Regu³a(regu³y)

source: # END block(s)
pl: # blok(i) END

source: # Functions, listed alphabetically
pl: # Funkcje, wypisane alfabetycznie

source: unexpected type %s in prec_level
pl: nieoczekiwany typ %s w prec_devel

source: Success
pl: Sukces

source: No match
pl: Nie pasuje

source: Invalid regular expression
pl: B³êdne wyra¿enie regularne

source: Invalid collation character
pl: B³êdny znak zestawienia

source: Invalid character class name
pl: B³êdna nazwa klasy znaków

source: Trailing backslash
pl: Odwrotny uko¶nik (backslash) na koñcu

source: Invalid back reference
pl: B³êdne odwo³anie wsteczne

source: Unmatched [ or [^
pl: Niedopasowane [ lub [^

source: Unmatched ( or \(
pl: Niedopasowane ( lub \(

source: Unmatched \{
pl: Niedopasowane \{

source: Invalid content of \{\}
pl: B³êdna zawarto¶æ \{\}

source: Invalid range end
pl: B³êdny koniec zakresu

source: Memory exhausted
pl: Pamiêæ wyczerpana

source: Invalid preceding regular expression
pl: B³êdne poprzedzaj±ce wyra¿enie regularne

source: Premature end of regular expression
pl: Przedwczesny koniec wyra¿enia regularnego

source: Regular expression too big
pl: Wyra¿enie regularne zbyt du¿e

source: Unmatched ) or \)
pl: Niedopasowane ) lub \)

source: No previous regular expression
pl: Brak poprzedniego wyra¿enia regularnego

source: BEGIN blocks must have an action part
pl: bloki BEGIN musz± mieæ czê¶æ akcyjn±

source: END blocks must have an action part
pl: bloki END musz± mieæ czê¶æ akcyjn±

source: `%s' is a built-in function, it cannot be redefined
pl: `%s' jest funkcj± wbudowan±, nie mo¿e byæ przedefiniowana

source: statement may have no effect
pl: instrukcja mo¿e byæ bez rezultatu

source: `next' used in BEGIN or END action
pl: `next' u¿yte w akcji BEGIN lub END

source: `nextfile' is a gawk extension
pl: `nextfile' jest rozszerzeniem gawka

source: `nextfile' used in BEGIN or END action
pl: `nextfile' u¿yte w akcji BEGIN lub END

source: `return' used outside function context
pl: `return' u¿yte poza kontekstem funkcji

source: plain `print' in BEGIN or END rule should probably be `print ""'
pl: samo `print' w regule BEGIN lub END zapewnie powinno byæ `print ""'

source: `delete array' is a gawk extension
pl: `delete array' jest rozszerzeniem gawka

source: multistage two-way pipelines don't work
pl: wieloetapowe dwukierunkowe potoki nie dzia³aj±

source: regular expression on right of assignment
pl: wyra¿enie regularne z prawej strony przypisania

source: non-redirected `getline' undefined inside END action
pl: nie przekierowane `getline' niezdefiniowane wewn±trz akcji END

source: regular expression on left of `~' or `!~' operator
pl: wyra¿enie regularne z lewej strony operatora `~' lub `!~'

source: regexp constant `/%s/' looks like a C comment, but is not
pl: sta³e wyra¿enie regularne `/%s/' wygl±da jak komentarz w C, ale nim nie jest

source: regular expression on right of comparison
pl: wyra¿enie regularne z prawej strony porównania

source: non-redirected `getline' undefined inside BEGIN or END action
pl: nie przekierowane `getline' niezdefiniowane wewn±trz akcji BEGIN lub END

source: call of `length' without parentheses is not portable
pl: wywo³anie `length' bez nawiasów jest nieprzeno¶ne

source: call of `length' without parentheses is deprecated by POSIX
pl: wywo³anie `length' bez nawiasów jest potêpione przez POSIX

source: invalid subscript expression
pl: b³êdne wyra¿enie w indeksie

source: fptr %x not in tokentab
pl: fptr %x nie znajduje siê w tokentab

source: unexpected newline
pl: nieoczekiwany znak nowej linii

source: empty program text on command line
pl: pusty tekst programu w linii poleceñ

source: can't open source file `%s' for reading (%s)
pl: nie mo¿na otworzyæ pliku ¼ród³owego `%s' do odczytu (%s)

source: can't read sourcefile `%s' (%s)
pl: nie mo¿na odczytaæ pliku ¼ród³owego `%s' (%s)

source: source file `%s' is empty
pl: plik ¼ród³owy `%s' jest pusty

source: source file does not end in newline
pl: plik ¼ród³owy nie koñczy siê znakiem koñca linii

source: unterminated regexp ends with `\' at end of file
pl: niezakoñczone wyra¿enie regularne koñczy siê `\' na koñcu pliku

source: unterminated regexp
pl: niezakoñczone wyra¿enie regularne

source: unterminated regexp at end of file
pl: niezakoñczone wyra¿enie regularne na koñcu pliku

source: use of `\ #...' line continuation is not portable
pl: u¿ycie kontynuacji linii `\ #...' jest nieprzeno¶ne

source: backslash not last character on line
pl: odwrotny uko¶nik (backslash) nie jest ostatnim znakiem linii

source: POSIX does not allow operator `**='
pl: POSIX nie dopuszcza operatora `**='

source: old awk does not support operator `**='
pl: stary awk nie obs³uguje operatora `**='

source: POSIX does not allow operator `**'
pl: POSIX nie dopuszcza operatora `**'

source: old awk does not support operator `**'
pl: stary awk nie obs³uguje operatora `**'

source: operator `^=' is not supported in old awk
pl: operator `^=' nie jest obs³ugiwany przez starego awka

source: operator `^' is not supported in old awk
pl: operator `^' nie jest obs³ugiwany przez starego awka

source: unterminated string
pl: niezakoñczony ³añcuch

source: invalid char '%c' in expression
pl: b³êdny znak '%c' w wyra¿eniu

source: `%s' is a gawk extension
pl: `%s' jest rozszerzeniem gawka

source: `%s' is a Bell Labs extension
pl: `%s' jest rozszerzeniem Bell Labs

source: POSIX does not allow `%s'
pl: POSIX nie dopuszcza `%s'

source: `%s' is not supported in old awk
pl: `%s' nie jest obs³ugiwane przez starego awka

source: `goto' considered harmful!
pl: `goto' uznane za szkodliwe!

source: %d is invalid as number of arguments for %s
pl: %d jest b³êdne jako liczba argumentów dla %s

source: match: third argument is a gawk extension
pl: match: trzeci argument jest rozszerzeniem gawka

source: %s: string literal as last arg of substitute has no effect
pl: %s: sta³a ³añcuchowa jako ostatni argument podstawienia nie da rezultatu

source: sub third parameter is not a changeable object
pl: trzeci parametr sub nie jest zmiennym obiektem

source: gsub third parameter is not a changeable object
pl: trzeci parametr gsub nie jest zmiennym obiektem

source: close: second argument is a gawk extension
pl: close: drugi argument jest rozszerzeniem gawka

source: use of dcgettext(_"...") is incorrect: remove leading underscore
pl: u¿ycie dcgettext(_"...") jest niepoprawne: trzeba usun±æ podkre¶lenie

source: use of dcngettext(_"...") is incorrect: remove leading underscore
pl: u¿ycie dcngettext(_"...") jest niepoprawne: trzeba usun±æ podkre¶lenie

source: function `%s': parameter #%d, `%s', duplicates parameter #%d
pl: funkcja `%s': parametr #%d, `%s', duplikuje parametr #%d

source: function `%s': parameter `%s' shadows global variable
pl: funkcja `%s': parametr `%s' przykrywa zmienn± globaln±

source: could not open `%s' for writing (%s)
pl: nie mo¿na otworzyæ `%s' do zapisu (%s)

source: %s: close failed (%s)
pl: %s: close nie powiod³o siê (%s)

source: shadow_funcs() called twice!
pl: shadow_funcs() wywo³ane podwójnie!

source: function `%s': can't use function name as parameter name
pl: funkcja `%s': nie mo¿na u¿yæ nazwy funkcji jako nazwy parametru

source: function name `%s' previously defined
pl: nazwa funkcji `%s' zosta³a ju¿ zdefiniowana

source: function `%s' called but never defined
pl: funkcja `%s' wywo³ana, ale nigdy nie zdefiniowana

source: function `%s' defined but never called
pl: funkcja `%s' zdefiniowana, ale nigdy nie wywo³ana

source: regexp constant for parameter #%d yields boolean value
pl: sta³e wyra¿enie regularne dla parametru #%d daje warto¶æ logiczn±

source: Unbalanced [
pl: Niesparowany [
