Repository: Nacist/gawk
Catalog: gawk-*.po
Languages: pl

source: Unfinished \ escape
pl: Niedokoñczone cytowanie \

source: unfinished repeat count
pl: niedokoñczona liczba powtórzeñ

source: malformed repeat count
pl: b³êdna liczba powtórzeñ

source: Unbalanced (
pl: Niesparowany (

source: No regexp syntax bits specified
pl: Nie podano bitów sk³adni wyra¿enia regularnego

source: Unbalanced )
pl: Niesparowany )

source: out of memory
pl: brak pamiêci

source: split: second argument is not an array
pl: split: drugi argument nie jest tablic±

source: split: null string for third arg is a gawk extension
pl: split: pusty ³añcuch jako trzeci argument jest rozszerzeniem gawka

source: `FIELDWIDTHS' is a gawk extension
pl: `FIELDWIDTHS' jest rozszerzeniem gawka

source: field %d in FIELDWIDTHS, must be > 0
pl: d³ugo¶æ %d w FIELDWIDTHS, musi byæ > 0

source: null string for `FS' is a gawk extension
pl: pusty ³añcuch dla `FS' jest rozszerzeniem gawka

source: cmd. line:
pl: linia poleceñ:

source: warning:
pl: uwaga:

source: error:
pl: b³±d:

source: fatal:
pl: krytyczne:

source: unknown nodetype %d
pl: nieznany typ wêz³a %d

source: buffer overflow in genflags2str
pl: przepe³nienie bufora w genflags2str

source: for loop: array `%s' changed size from %d to %d during loop execution
pl: pêtla for: tablica `%s' zmieni³a rozmiar z %d na %d podczas wykonywania pêtli

source: `break' outside a loop is not portable
pl: `break' na zewn±trz pêtli jest nieprzeno¶ne

source: `break' outside a loop is not allowed
pl: `break' na zewn±trz pêtli jest niedozwolone

source: `continue' outside a loop is not portable
pl: `continue' na zewn±trz pêtli jest nieprzeno¶ne

source: `continue' outside a loop is not allowed
pl: `continue' na zewn±trz pêtli jest niedozwolone

source: `next' cannot be called from a BEGIN rule
pl: `next' nie mo¿e byæ wywo³ane z regu³y BEGIN

source: `next' cannot be called from an END rule
pl: `next' nie mo¿e byæ wywo³ane z regu³y END

source: `nextfile' cannot be called from a BEGIN rule
pl: `nextfile' nie mo¿e byæ wywo³ane z regu³y BEGIN

source: `nextfile' cannot be called from an END rule
pl: `nextfile' nie mo¿e byæ wywo³ane z regu³y END

source: statement has no effect
pl: instrukcja bez rezultatu

source: reference to uninitialized variable `%s'
pl: odwo³anie do niezainicjowanej zmiennej `%s'

source: can't use function name `%s' as variable or array
pl: nie mo¿na u¿yæ nazwy funkcji `%s' jako zmiennej ani tablicy

source: reference to uninitialized argument `%s'
pl: odwo³anie do niezainicjowanego argumentu `%s'

source: assignment used in conditional context
pl: przypisanie u¿yte w kontek¶cie warunku

source: concatenation: side effects in one expression have changed the length of another!
pl: ³±czenie: efekty uboczne w jednym wyra¿eniu mog± zmieniæ d³ugo¶æ innego!

source: division by zero attempted
pl: próba dzielenia przez zero

source: division by zero attempted in `%%'
pl: próba dzielenia przez zero w `%%'

source: division by zero attempted in `/='
pl: próba dzielenia przez zero w `/='

source: division by zero attempted in `%%='
pl: próba dzielenia przez zero w `%%='

source: %s (from %s)
pl: %s (z %s)

source: function `%s' called with more arguments than declared
pl: funkcja `%s' wywo³ana z wiêksz± liczb± argumentów ni¿ zadeklarowano

source: function `%s' not defined
pl: funkcja `%s' nie zdefiniowana

source: function %s called
pl: funkcja %s wywo³ana

source: # Function Call Stack:
pl: # Stos wywo³añ funkcji:

source: # -- main --
pl: # -- g³ówna --

source: attempt to field reference from non-numeric value
pl: próba odwo³ania do pola z warto¶ci nieliczbowej

source: attempt to reference from null string
pl: próba odwo³ania z ³añcucha pustego

source: attempt to access field %d
pl: próba dostêpu do pola %d

source: attempt to use scalar parameter `%s' as an array
pl: próba u¿ycia parametru skalarnego `%s' jako tablicy

source: `IGNORECASE' is a gawk extension
pl: `IGNORECASE' jest rozszerzeniem gawka

source: `BINMODE' is a gawk extension
pl: `BINMODE' jest rozszerzeniem gawka

source: bad `%sFMT' specification `%s'
pl: z³e okre¶lenie `%sFMT': `%s'

source: turning off `--lint' due to assignment to `LINT'
pl: wy³±czenie `--lint' z powodu przypisania do `LINT'

source: NF set to negative value
pl: NF ustawione na warto¶æ ujemn±

source: cannot open file `%s' for reading (%s)
pl: nie mo¿na otworzyæ pliku `%s' do odczytu (%s)

source: close of fd %d (`%s') failed (%s)
pl: zamkniêcie deskryptora %d (`%s') nie powiod³o siê (%s)

source: invalid tree type %s in redirect()
pl: b³êdny typ drzewa %s w redirect()

source: expression in `%s' redirection only has numeric value
pl: wyra¿enie w przekierowaniu `%s' ma tylko warto¶æ liczbow±

source: expression for `%s' redirection has null string value
pl: wyra¿enie dla przekierowania `%s' ma warto¶æ bêd±c± ³añcuchem pustym

source: filename `%s' for `%s' redirection may be result of logical expression
pl: nazwa pliku `%s' dla przekierowania `%s' mo¿e byæ wynikiem wyra¿enia logicznego

source: unnecessary mixing of `>' and `>>' for file `%.*s'
pl: niepotrzebne mieszanie `>' i `>>' dla pliku `%.*s'

source: can't open pipe `%s' for output (%s)
pl: nie mo¿na otworzyæ potoku `%s' do zapisu (%s)

source: can't open pipe `%s' for input (%s)
pl: nie mo¿na otworzyæ potoku `%s' do odczytu (%s)

source: can't open two way socket `%s' for input/output (%s)
pl: nie mo¿na otworzyæ dwukierunkowego gniazda `%s' do odczytu/zapisu (%s)

source: can't open two way pipe `%s' for input/output (%s)
pl: nie mo¿na otworzyæ dwukierunkowego potoku `%s' do odczytu/zapisu (%s)

source: can't redirect from `%s' (%s)
pl: nie mo¿na przekierowaæ z `%s' (%s)

source: can't redirect to `%s' (%s)
pl: nie mo¿na przekierowaæ do `%s' (%s)

source: reached system limit for open files: starting to multiplex file descriptors
pl: osi±gniêto limit otwartych plików: rozpoczêcie multipleksowania deskryptorów

source: close of `%s' failed (%s).
pl: zamkniêcie `%s' nie powiod³o siê (%s).

source: too many pipes or input files open
pl: zbyt du¿o otwartych potoków lub plików wej¶ciowych

source: close: second argument must be `to' or `from'
pl: close: drugim argumentem musi byæ `to' lub `from'

source: close: `%.*s' is not an open file, pipe or co-process
pl: close: `%.*s' nie jest otwartym plikiem, potokiem lub ko-procesem

source: close of redirection that was never opened
pl: zamkniêcie przekierowania, które nigdy nie by³o otwarte

source: close: redirection `%s' not opened with `|&', second argument ignored
pl: close: przekierowanie `%s' nie by³o otwarte przez `|&', zignorowano drugi argument

source: failure status (%d) on pipe close of `%s' (%s)
pl: stan niepowodzenia (%d) przy zamykaniu potoku `%s' (%s)

source: failure status (%d) on file close of `%s' (%s)
pl: stan niepowodzenia (%d) przy zamykaniu pliku `%s' (%s)

source: no explicit close of socket `%s' provided
pl: nie zadano wprost zamkniêcia gniazda `%s'

source: no explicit close of co-process `%s' provided
pl: nie zadano wprost zamkniêcia ko-procesu `%s'

source: no explicit close of pipe `%s' provided
pl: nie zadano wprost zamkniêcia potoku `%s'

source: no explicit close of file `%s' provided
pl: nie zadano wprost zamkniêcia pliku `%s'

source: error writing standard output (%s)
pl: b³±d podczas zapisu na standardowe wyj¶cie (%s)

source: error writing standard error (%s)
pl: b³±d podczas zapisu na standardowe wyj¶cie b³êdów (%s)

source: pipe flush of `%s' failed (%s).
pl: opró¿nienie potoku `%s' nie powiod³o siê (%s).

source: co-process flush of pipe to `%s' failed (%s).
pl: opró¿nienie ko-procesu potoku do `%s' nie powiod³o siê (%s).

source: file flush of `%s' failed (%s).
pl: opró¿nienie pliku `%s' nie powiod³o siê (%s).

source: /inet/raw client not ready yet, sorry
pl: klient /inet/raw niestety jeszcze nie gotowy

source: only root may use `/inet/raw'.
pl: tylko root mo¿e u¿yæ `/inet/raw'.

source: /inet/raw server not ready yet, sorry
pl: serwer /inet/raw niestety jeszcze nie gotowy

source: no (known) protocol supplied in special filename `%s'
pl: nie podano (znanego) protoko³u w pliku specjalnym `%s'

source: special file name `%s' is incomplete
pl: nazwa pliku specjalnego `%s' jest niekompletna

source: local port invalid in `%s'
pl: b³êdny port lokalny w `%s'

source: must supply a remote hostname to `/inet'
pl: trzeba podaæ nazwê zdalnego hosta dla `/inet'

source: must supply a remote port to `/inet'
pl: trzeba podaæ zdalny port dla `/inet'

source: remote port invalid in `%s'
pl: b³êdny port zdalny w `%s'

source: TCP/IP communications are not supported
pl: komunikacja TCP/IP nie jest obs³ugiwana

source: file `%s' is a directory
pl: plik `%s' jest katalogiem

source: use `PROCINFO["%s"]' instead of `%s'
pl: nale¿y u¿ywaæ `PROCINFO["%s"]' zamiast `%s'

source: use `PROCINFO[...]' instead of `/dev/user'
pl: nale¿y u¿ywaæ `PROCINFO[...]' zamiast `/dev/user'

source: could not open `%s', mode `%s'
pl: nie mo¿na otworzyæ `%s', tryb `%s'

source: moving pipe to stdout in child failed (dup: %s)
pl: przeniesienie potoku na stdout w potomku nie powiod³o siê (dup: %s)

source: moving pipe to stdin in child failed (dup: %s)
pl: przeniesienie potoku na stdin w potomku nie powiod³o siê (dup: %s)

source: restoring stdout in parent process failed
pl: odtworzenie stdout w procesie nadrzêdnym nie powiod³o siê

source: restoring stdin in parent process failed
pl: odtworzenie stdin w procesie nadrzêdnym nie powiod³o siê

source: close of stdout in child failed (%s)
pl: zamkniêcie stdout w potomku nie powiod³o siê (%s)

source: close of stdin in child failed (%s)
pl: zamkniêcie stdin w potomku nie powiod³o siê (%s)

source: close of pipe failed (%s)
pl: zamkniêcie potoku nie powiod³o siê (%s)

source: `|&' not supported
pl: `|&' nie obs³ugiwane

source: cannot open pipe `%s' (%s)
pl: nie mo¿na otworzyæ potoku `%s' (%s)

source: cannot create child process for `%s' (fork: %s)
pl: nie mo¿na utworzyæ procesu potomnego dla `%s' (fork: %s)

source: data file `%s' is empty
pl: plik danych `%s' jest pusty

source: internal error: file `%s', line %d
pl: b³±d wewnêtrzny: plik %s, wiersz %d

source: error reading input file `%s': %s
pl: b³±d podczas odczytu pliku wej¶ciowego `%s': %s

source: multicharacter value of `RS' is a gawk extension
pl: wieloznakowa warto¶æ `RS' jest rozszerzeniem gawka

source: can't convert string to float
pl: nie mo¿na przekszta³ciæ ³añcucha do liczby zmiennoprzecinkowej

source: backslash at end of string
pl: odwrotny uko¶nik (backslash) na koñcu ³añcucha

source: POSIX does not allow `\x' escapes
pl: POSIX nie dopuszcza kodów znaków `\x'

source: no hex digits in `\x' escape sequence
pl: brak cyfr szesnastkowych w sekwencji `\x'

source: escape sequence `\%c' treated as plain `%c'
pl: sekwencja unikowa `\%c' jest traktowana jak czyste `%c'

source: regex match failed, not enough memory to match string "%.*s%s"
pl: dopasowanie wyra¿enia reg. nie powiod³o siê, za ma³o pamiêci by dopasowaæ "%.*s%s"

source: %s %s `%s': could not set close-on-exec: (fcntl: %s)
pl: %s %s `%s': nie mo¿na ustawiæ close-on-exec: (fcntl: %s)
